app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$C90fp4p21ydCx9x2ScLgMO0Vu1d9Ggd07/UdPxAoSBlwrrWmnBVze', "remember_token" = 'T5tFLg5XSmROVtxgyWsNqw', "updated_at" = '2013-06-11 17:26:27.951262' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])